/*
	算数运算符:
		+: 加, A + B
		-: 减, A - B
		*: 乘, A * B
		/: 除, A / B
		%: 取余, A % B
		++: 自增运算符, 将整数值加1, A++
		--: 自减运算符, 将整数值减一, A--
	关系运算符:
		==: 检查两个变量的值是否相等, A == B
		!=: 检查两个变量的值是否不相等, A != B
		>: 大于, A > B
		<: 小于, A < B
		>=: 大于或等于, A >= B
		<=: 小于或等于, A <= B
	逻辑运算符:
		&&: 逻辑与运算符,
		||: 逻辑或运算符-
		!: 逻辑非运算符
	按位运算符:
		&: 按位与,都为1则结果为1
		|: 按位或,有一个为1则结果为1
		^: 按位异或,对应位不同数值时结果为1
		<<: 左移,把数整体向左移动
		>>: 右移,把数整体向右移动
	赋值运算符:
		=: 基本赋值运算符
		+=: 相加后再赋值
		-=: 相减后赋值
		*=: 相乘后赋值
		/=: 相除后赋值
		%=: 求余后赋值
		<<=: 左移后赋值
		>>=: 右移后赋值
		&=: 按位与后赋值
		^=: 按位异或后赋值
		|=: 按位或后赋值
*/

package main

func main() {

}
